# GroupId Property (2022)

---
C#Visual BasicVisual C++
Revit 2022 API
---
FabricationPartSizeMap..::..GroupId Property
FabricationPartSizeMap Class See Also
---
This property is deprecated in Revit 2022 and may be removed in a future version of Revit. Please use the `PaletteId` method instead.
**Namespace:** Autodesk.Revit.DB.Fabrication**Assembly:** RevitAPI (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)**Since:** 2018.2
# Syntax
C#
---
```text
[ObsoleteAttribute]
public int GroupId { get; set; }
```

Visual Basic
---
```text
<ObsoleteAttribute> _
Public Property GroupId As Integer
	Get
	Set
```

Visual C++
---
```text
[ObsoleteAttribute]
public:
property int GroupId {
	int get ();
	void set (int value);
}
```

# See Also
FabricationPartSizeMap Class
Autodesk.Revit.DB.Fabrication Namespace